readme.org
#+TITLE: Personal Portfolio
#+OPTIONS: toc:nil

* Personal Portfolio
:PROPERTIES:
:UNNUMBERED: notoc
:END:

#+TOC: headlines

* Under Construction
This readme will become more extensive in the future.

* Design Goals
- Look clean and attractive
- Display well on all screen sizes
- Have some personality
- Make useful information available quickly
- Don't be excessive or overblown

* Org file template
Top of org files in =org=:

  #+BEGIN_EXAMPLE
  #+STARTUP: showall
  #+OPTIONS: toc:nil num:nil
  #+BEGIN_EXPORT html
  ---
  layout: [layout]
  title: [title]
  ---
  #+END_EXPORT
  #+END_EXAMPLE

- Layout refers to an html layout in =_layouts=
- The title will become both page title and an h1 at the top of the
  page, below the nav elements
- Top level headlines become h2

* Generating the site
- Run =make publish= to have all html files generated by org, ready
  for jekyll
- Run =make serve= to publish all, generate =_site=, and serve site
  locally for testing
- Run =make clean= to remove all site files generated by org or jekyll

* To do
- [ ] Add a colophon
- [ ] Format the readme properly
- [ ] Collapsible tables of contents?

* Future
- Possibly switch to Hugo and ox-hugo

