readme.md


<a id="org77efde6"></a>

# Personal Portfolio


# Table of Contents

1.  [Under Construction](#orgda08fc3)
2.  [Design Goals](#org66233dd)
3.  [Org file template](#orgf64a716)
4.  [Generating the site](#orga51cc9b)
5.  [To do](#org057a043)
6.  [Future](#org843124c)


<a id="orgda08fc3"></a>

# Under Construction

This readme will become more extensive in the future.


<a id="org66233dd"></a>

# Design Goals

-   Look clean and attractive
-   Display well on all screen sizes
-   Have some personality
-   Make useful information available quickly
-   Don't be excessive or overblown


<a id="orgf64a716"></a>

# Org file template

Top of org files in `org`:

    #+STARTUP: showall
    #+OPTIONS: toc:nil num:nil
    #+BEGIN_EXPORT html
    ---
    layout: [layout]
    title: [title]
    ---
    #+END_EXPORT

-   Layout refers to an html layout in `_layouts`
-   The title will become both page title and an h1 at the top of the
    page, below the nav elements
-   Top level headlines become h2


<a id="orga51cc9b"></a>

# Generating the site

-   Run `make publish` to have all html files generated by org, ready
    for jekyll
-   Run `make serve` to publish all, generate `_site`, and serve site
    locally for testing
-   Run `make clean` to remove all site files generated by org or jekyll


<a id="org057a043"></a>

# To do

-   [ ] Add a colophon
-   [ ] Format the readme properly
-   [ ] Collapsible tables of contents?


<a id="org843124c"></a>

# Future

-   Possibly switch to Hugo and ox-hugo

